<?php
global $text;

$text['hello']='Хотите розыгрышей? Их есть у нас!

Команды бота:
/menu - Меню бота';
$text['btnReady'] = 'Готово';
$text['btnTextYes'] = 'Да';
$text['btnTextNo'] = 'Нет';
$text['textAddError'] = 'Ошибка добавления нового пользователя.';
$text['userInBase'] = 'Пользователь присутствует в базе.';
$text['newQuest'] = 'Создаем новый розыгрыш.';
$text['newLottery'] = 'Введите название розыгрыша:
Можно использовать максимум 100 символов!
Это поле используется в списке активных розыгрышей у пользователя. Подойдите к названию максимально отвественно, иначе ваши участники могут запутаться и не найти ваш запущенный розыгрыш в разделе "активные розыгрыши".';
$text['getDescription'] = 'Введите текст подробного описания розыгрыша:
Можно использовать максимум 2500 символов!
Опишите подробно правила розыгрыша для ваших подписчиков. После запуска введённый текст будет опубликован во все привязанные к розыгрышу каналы.';
$text['getImage'] = 'Хотите добавить картинку для розыгрыша?';
$text['callbackText'] = '';
$text['getDateStart'] = 'Введите время по MSK и дату запуска розыгрыша в формате (ЧЧ:ММ ДД.ММ.ГГГГ)
Например: 11:00 24.10.2022';
$text['getDateEnd'] = 'Введите время по MSK и дату завершения розыгрыша в формате (ЧЧ:ММ ДД.ММ.ГГГГ)
Например: 11:00 28.10.2022';
$text['countWinners'] = 'Введите количество победителей (только число):';
$text['sendPicture'] = 'Отправьте изображение';
$text['dateError'] = 'Дата не корректна.';
$text['countWinnersError'] = 'Не корректное количество победителей.';
$text['errorImgFormat'] = 'Файл не является изображением.';
$text['continueLottery'] = 'Выберите действие для продолжения:';
$text['lotteryReady'] = 'Розыгрыш создан.';
$text['addChannels'] = 'Каналы';
$text['createLottery'] = 'Новый розыгрыш';
$text['mainMenu'] = 'Меню управления розыгрышами';
$text['activeLottery'] = 'Активные розыгрыши';
$text['lotteryComplete'] = 'Завершенные розыгрыши';
$text['createLotteryError'] = 'Ошибка создания розыгрыша.';
$text['toLottery'] = ' к розыгрышу №';
$text['delLottery'] = 'Удалить розыгрыш №';
$text['title'] = 'Название конкурса: ';
$text['description'] = 'Описание конкурса: ';
$text['winnersCount'] = 'Количество победителей: ';
$text['dateFinal'] = 'Дата окончания: ';
$text['connectToChannel'] = 'Для подключения канала к текущему розыгрышу перешлите сюда любое сообщение из нужного канала.';
$text['addBotToChanAdmin'] = 'Вы должны добавить бота в администраторы выбранного канала.';
$text['botIsAdmin'] = 'Канал подключен.';
$text['acceptLottery'] = 'Желаете принять участие в розыгрыше?';
$text['agree'] = 'Участвовать';
$text['lotteryToChanSended'] = 'Конкурс отправлен в канал';
$text['alreadyInLottery'] = 'Вы уже участвуете.';
$text['inLottery'] = 'Вы участвуете';
$text['createdLottery'] = 'Созданные розыгрыши';
$text['startedLottery'] = 'Запущенные розыгрыши';
$text['enableLottery'] = 'Запустить конкурс #';
$text['stopLottery'] = 'Завершить конкурс';
$text['notFoundWinner'] = 'Победитель не найден. Возможно нет участников.';
$text['winnerOfLottery'] = 'Победитель конкурса: ';
$text['lotteryFinished'] = 'Розыгрыш успешно завершен';
$text['noActiveLottery'] = 'Нет запущенных розыгрышей.';
$text['userIsNotAdmin'] = 'Вы не являетесь администратором данного канала.';
$text['lotteryNotActive'] = 'Конкурс не активен';
$text['deleteCurrentLottery'] = 'Конкурс удален';
$text['addNextChannel'] = 'Добавить еще канал';



$text['default'] = 'Этот текст появляется когда боту ничего не понятно.';
?>